type DistrictCoordinates = [name: string, latitude: number, longitude: number];

const districtCoordinates: DistrictCoordinates[] = [
  ['พระนครศรีอยุธยา', 14.3525, 100.5585],
  ['ท่าเรือ', 14.5333, 100.7104],
  ['นครหลวง', 14.4676, 100.6257],
  ['บางไทร', 14.2137, 100.4847],
  ['บางบาล', 14.3839, 100.4646],
  ['บางปะอิน', 14.2390, 100.5943],
  ['บางปะหัน', 14.4734, 100.5491],
  ['บางซ้าย', 14.3211, 100.3025],
  ['บ้านแพรก', 14.6435, 100.5500],
  ['ผักไห่', 14.4514, 100.3425],
  ['ภาชี', 14.4395, 100.7238],
  ['ลาดบัวหลวง', 14.1691, 100.3532],
  ['วังน้อย', 14.2443, 100.7229],
  ['เสนา', 14.2959, 100.3755],
  ['อุทัย', 14.3564, 100.6953],
  ['มหาราช', 14.5734, 100.5391],
];

export const districts = districtCoordinates.map(([name, lat, lon]) => ({ name, lat, lon }));
